app/controllers/songs_controller.rb

  def show
    @artist = Artist.find_by(id params[:artist_id])
    @song = @artist.songs.find_by(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]